; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v4 - type_2 ?v7 - type_3)
 	      (pred_2 ?v2 - object ?v7 - type_3)
	      (pred_4 ?v4 - type_2 ?v1 - type_1)
	      (pred_1 ?v4 - type_2 ?v2 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v4 - type_2 ?v3 ?v5 - type_3)
       :precondition (and  (pred_3 ?v4 ?v3))
       :effect (and  (pred_3 ?v4 ?v5)
		     (not (pred_3 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_2 ?v6 - object ?v8 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v8) (pred_3 ?v4 ?v8) (pred_4 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v8)) 
		    (not (pred_4 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_2 ?v6 - object ?v8 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v6 ?v1) (pred_3 ?v4 ?v8))
       :effect (and (pred_2 ?v6 ?v8)
		    (pred_4 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v6 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_01 - type_1
obj_11 obj_08 obj_09 obj_07 - type_3
obj_02 obj_13 obj_03 obj_06 - type_2
obj_12 obj_04 obj_05 - object)
(:init
(pred_3 obj_10 obj_02)
(pred_4 obj_10 obj_11)
(pred_4 obj_10 obj_08)
(pred_3 obj_01 obj_03)
(pred_4 obj_01 obj_09)
(pred_4 obj_01 obj_07)
(pred_2 obj_12 obj_13)
(pred_2 obj_04 obj_13)
(pred_2 obj_05 obj_06)
)
(:goal
(and
(pred_2 obj_12 obj_06)
(pred_2 obj_04 obj_13)
(pred_2 obj_05 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_10 obj_06) (pred_3 obj_01 obj_06))))
  )
)
)

; plan
1. (op_2 obj_10 obj_02 obj_13)
   deleted: (pred_3 obj_10 obj_02)
   added: (pred_3 obj_10 obj_13)
   goals met: 2 of 3
2. (op_1 obj_10 obj_12 obj_13 obj_08)
   deleted: (pred_2 obj_12 obj_13) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_12 obj_08)
   goals met: 2 of 3
3. (op_2 obj_10 obj_13 obj_06)
   deleted: (pred_3 obj_10 obj_13)
   added: (pred_3 obj_10 obj_06)
   goals met: 2 of 3
4. (op_3 obj_10 obj_12 obj_06 obj_08)
   deleted: (pred_1 obj_10 obj_12 obj_08)
   added: (pred_2 obj_12 obj_06) (pred_4 obj_10 obj_08)
   goals met: 3 of 3
